{
  "article": {
    "id": 25199,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20220826C1822",
    "title": "Finlay Minerals completes Acquisition of the ATG Property expanding the ATTY Property",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Aug. 26, 2022</span></span> /CNW/ - <b>Finlay Minerals Ltd. </b>(TSXV: FYL) (OTCQB: FYMNF) (\"<b>Finlay</b>\" or the \"<b>Company</b>\") is pleased to announce that, further to its news release issued on <span class=\"xn-chron\">July 11, 2022</span>, the Company has today closed its acquisition of the ATG Property from Electrum Resource Corporation (\"<b>Electrum</b>\"), expanding Finlay's ATTY Property. The acquisition was completed pursuant to the terms of an agreement dated as of <span class=\"xn-chron\">July 11, 2022</span> between the Company and Electrum (the \"<b>Purchase Agreement</b>\"). The ATTY Property, which was purchased from Electrum in 1999, and the ATG Property are contiguous and located in the Toodoggone Mining District of <span class=\"xn-location\">British Columbia</span>; they are neighboured, to the south by Centerra Gold Inc.'s Kemess Underground and Kemess East copper (Cu) – gold (Au) porphyry deposits, and to the north by Amarc Resources – Freeport McMoRan's Joy property.</p>\n<p>Pursuant to the Purchase Agreement, Finlay acquired the ATG Property, which comprises three mineral tenures totaling approximately 1,105 hectares, for consideration consisting of 1,750,000 fully paid common shares of Finlay with a deemed value of <span class=\"xn-money\">$0.08</span> per share, for a deemed total value of <span class=\"xn-money\">$140,000</span> (the \"<b>Transaction</b>\").</p>\n<p>The ATTY Property was subject to a 3% net smelter return royalty held by Electrum (the \"<b>NSR Royalty</b>\"), with Finlay retaining the right to buy back one-half of the NSR Royalty (1.5%) for an aggregate payment to Electrum in the amount of <span class=\"xn-money\">$1,000,000</span> (the \"Buy-Back Right\"). As a result of the Transaction, the NSR Royalty applies over the Combined Property (as defined below) and, pursuant to the terms of the Purchase Agreement, the <b>Buy-Back Right</b> has been amended such that Finlay retains the right to buy back one-half of the NSR Royalty (1.5%) for an aggregate payment to Electrum in the amount of <span class=\"xn-money\">$1,500,000</span>.</p>\n<p>The purchase of the ATG Property (which is northwest of and contiguous with the ATTY Property) pursuant to the Transaction expands Finlay's ATTY Property to 15 mineral tenures totaling approximately 4,498 hectares (collectively, the \"<b>Combined Property</b>\"). (<b><i>Click</i> <i><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3632200-1&amp;h=1943424185&amp;u=https%3A%2F%2Ffinlayminerals.com%2Fsite%2Fassets%2Ffiles%2F1830%2Fatty-and-atg-properties-map-for-july-11-2022-nr.pdf&amp;a=HERE\" rel=\"nofollow\" target=\"_blank\">HERE</a></u></i></b> to view the Company's ATTY and ATG Property).</p>\n<p>Electrum and Baril Developments Ltd., each of which is a private <span class=\"xn-location\">British Columbia</span> company controlled by <span class=\"xn-person\">John J. Barakso</span>, <span class=\"xn-person\">Ilona B. Lindsay</span> and Dr. <span class=\"xn-person\">John A. Barakso</span>, and a personal trust of which <span class=\"xn-person\">John J. Barakso</span> is the sole trustee and of which <span class=\"xn-person\">Ilona B. Lindsay</span> and Dr. <span class=\"xn-person\">John A. Barakso</span> are beneficiaries, are the registered holders, in the aggregate, of more than 20% of the voting rights attached to the Company's issued and outstanding common shares. In addition, each of <span class=\"xn-person\">Ilona B. Lindsay</span> and Dr. <span class=\"xn-person\">John A. Barakso</span> is a director and/or officer of the Company. As a result, the Transaction constituted a \"related party transaction\" within the meaning of TSXV Policy 5.9 and Multilateral Instrument 61-101 – <i>Protection of Minority Security Holders in Special Transactions</i> (\"<b>MI 61-101</b>\"). The Company relied on the exemptions from the formal valuation and minority shareholder approval requirements of MI 61-101 provided by subsections 5.5(a) and 5.7(1) (a) of MI 61-101, on the basis that, at the time the Transaction was agreed to, neither the fair market value of the ATG Property to be acquired pursuant to, nor the fair market value of the consideration for, the Transaction exceeded 25% of Finlay's market capitalization as determined in accordance with MI 61-101.</p>\n<p>No finders' fees were paid in connection with the Transaction and no new insiders or control persons were created.</p>\n<p><span class=\"xn-person\">Robert Brown</span>, President and Chief Executive Officer of Finlay, states:</p>\n<p><b>\"</b><i>The ATG Property is strategically positioned south of Amarc's Joy Property and contiguous to the ATTY Property. In 2021, an exploration program consisting of soil sampling and alteration mapping outlined a <span class=\"xn-money\">600m</span> x <span class=\"xn-money\">1,000m</span> Cu and Au geochemical anomaly around the ATG's Wrich showing. The Wrich geochemical anomaly connects with the Cu and Au geochemical anomaly on the SW Takla target on the Joy and the two combined geochemical anomalies cover an area of <span class=\"xn-money\">2,700m</span> x <span class=\"xn-money\">1,500m</span>. </i></p>\n<p><i>The ATG Property adds a porphyry target at Wrich and joins several compelling targets at ATTY including the drill-ready KEM target, which represents potential Kemess East-style porphyry mineralization, and the drill-ready Attycelley epithermal Au, Cu, silver, lead, and zinc target.</i>\" </p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold; text-align: left;\"><b>Qualified Person:</b></div><p><span class=\"xn-person\">Wade Barnes</span>, P. Geo. and Vice President, Exploration for Finlay and a qualified person as defined by National Instrument 43-101, has approved the technical content of this news release.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold; text-align: left;\"><b>About Finlay Minerals Ltd.</b></div><p>Finlay is a TSXV company focused on exploration for base and precious metal deposits in northern <span class=\"xn-location\">British Columbia</span>.</p>\n<p>Finlay trades under the symbol \"FYL\" on the TSXV and under the symbol \"FYMNF\" on the OTCQB. For further information and details, please visit the Company's website at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3632200-1&amp;h=1622758264&amp;u=https%3A%2F%2Ffinlayminerals.com%2F&amp;a=www.finlayminerals.com\" rel=\"nofollow\" target=\"_blank\">www.finlayminerals.com</a></p>\n<p><b>On behalf of the Board of Directors,</b></p>\n<p><span class=\"xn-person\">Robert F. Brown</span>, P. Eng.<br></br>President &amp; CEO</p>\n<p><i>Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release.</i></p>\n<p><b><i>Forward-Looking Information:</i></b><i> This news release includes certain \"forward-looking information\" and \"forward-looking statements\" (collectively, \"<b>forward-looking statements</b>\") within the meaning of applicable Canadian securities legislation. All statements in this news release that address events or developments that we expect to occur in the future are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, although not always, identified by words such as \"expect\", \"plan\", \"anticipate\", \"project\", \"target\", \"potential\", \"schedule\", \"forecast\", \"budget\", \"estimate\", \"intend\" or \"believe\" and similar expressions or their negative connotations, or that events or conditions \"will\", \"would\", \"may\", \"could\", \"should\" or \"might\" occur. All such forward-looking statements are based on the opinions and estimates of management as of the date such statements are made. Although Finlay believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploration results, availability of capital and financing and general economic, market or business conditions, and the other risk factors described in Finlay's filings with Canadian securities regulators on SEDAR at <a href=\"http://www.sedar.com\" rel=\"nofollow\">www.sedar.com</a>. These forward-looking statements are based on a number of assumptions including, among other things, assumptions regarding general business and economic conditions, the timing and receipt of regulatory and governmental approvals, the ability of Finlay and other parties to satisfy stock exchange and other regulatory requirements in a timely manner, the availability of financing for Finlay's proposed transactions and programs on reasonable terms, and the ability of third party service providers to deliver services in a timely manner. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Finlay does not assume any obligation to update or revise its forward-looking statements, whether as a result of new information, future or otherwise, except as required by applicable law.</i></p>\n<p>SOURCE  Finlay Minerals Ltd.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C1822&amp;Transmission_Id=202208261520CANADANWCANADAPR_C1822&amp;DateId=20220826\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Atty,Finlay Minerals Ltd.,FYL",
    "master_gid": 1317,
    "date": "2022-08-26T19:20:00.000Z",
    "tags": "Canada||Toodoggone Mining Camp,Golden Horseshoe|Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 457,
    "provider": null,
    "excerpt": "VANCOUVER, BC,Aug. 26, 2022/CNW/ -Finlay Minerals Ltd.(TSXV: FYL) (OTCQB: FYMNF) (\"Finlay\" or the \"Company\") is pleased to announce that, further to its news release issued onJuly 11, 2022, the Company has today closed its acquisition of the ATG Property from Electrum Resource Corporation (\"Electrum\"), expanding Finlay's ATTY Property. The acquisition was completed",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Finlay Minerals Ltd.",
    "exchange": "TSXV",
    "root_ticker": "FYL",
    "project_name": "ATTY",
    "gid": 1317,
    "location": "British Columbia, Canada",
    "plan_id": "companytier2"
  },
  "articleProject": {
    "gid": 1317,
    "project_name": "ATTY",
    "location": "British Columbia, Canada"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 457,
  "articleTicker": "FYL",
  "articleCompanyName": "Finlay Minerals Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 457,
      "gid": 1317,
      "project_name": "ATTY",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 457,
      "gid": 1316,
      "project_name": "PIL",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 457,
      "gid": 7750,
      "project_name": "SAY",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 457,
      "gid": 10291,
      "project_name": "JJB",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 457,
      "gid": 217,
      "project_name": "Silver Hope",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 109294,
      "company_id": 457,
      "title": "Finlay Minerals Ltd. reports on its Annual General &amp; Special Meeting",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250625C1152",
      "date": "2025-06-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 108483,
      "company_id": 457,
      "title": "Finlay Minerals announces the commencement of the 2025 PIL &amp; ATTY Property Exploration Programs",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250618C9255",
      "date": "2025-06-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107086,
      "company_id": 457,
      "title": "Finlay Minerals Announces Increase in Size of Non-Brokered Private Placement of Flow-Through Shares and Non-Flow-Through Units",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250604C0526",
      "date": "2025-06-05T00:39:00.000Z",
      "hidden": false
    },
    {
      "id": 105733,
      "company_id": 457,
      "title": "Finlay Minerals Announces Non-Brokered Private Placement of Flow-Through Shares and Non-Flow-Through Units",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250526C7629",
      "date": "2025-05-26T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104309,
      "company_id": 457,
      "title": "Finlay Minerals Appoints an Executive Chairman, President &amp; CEO, and Vice President, Corporate Development",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250512C3343",
      "date": "2025-05-12T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103318,
      "company_id": 457,
      "title": "Finlay Minerals Receives TSX Venture Exchange Approval for PIL Earn-In Agreement",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250502C5071",
      "date": "2025-05-02T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100579,
      "company_id": 457,
      "title": "Finlay Minerals stakes the JJB Property - within the Bear Lake Corridor of British Columbia",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250423C5360",
      "date": "2025-04-23T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -191292,
      "company_id": 457,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - FYL",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250417C5679",
      "date": "2025-04-17T17:21:00.000Z",
      "hidden": false
    },
    {
      "id": -191290,
      "company_id": 457,
      "title": "Canadian Investment Regulatory Organization Trading Halt - FYL",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250417C4775",
      "date": "2025-04-17T16:44:00.000Z",
      "hidden": false
    },
    {
      "id": 100218,
      "company_id": 457,
      "title": "Finlay Minerals Enters into Earn-In Agreements with Freeport for its PIL &amp; ATTY Properties",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250417C8713",
      "date": "2025-04-17T16:43:00.000Z",
      "hidden": false
    }
  ]
}