{
  "article": {
    "id": 64454,
    "link": "https://www.newsfilecorp.com/release/215842/LaFleur-Minerals-Exercises-Option-to-Acquire-Swanson-Property-in-the-Abitibi-Greenstone-Belt-Quebec",
    "title": "LaFleur Minerals Exercises Option to Acquire Swanson Property in the Abitibi Greenstone Belt, Quebec",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/215842/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - July 8, 2024) - <b>LaFleur Minerals Inc. (CSE: LFLR) (OTC Pink: WPNNF) </b>(the \"<b>Company</b>\") is pleased to announce that it has fully exercised its option to acquire 141 mineral claims covering 5,579 hectares located in the Province of Qu&#233;bec, Canada, adjacent to the Swanson gold deposit (the \"<b>Property</b>\"). </p><p>As announced by the Company on June 17, 2024, the Company entered into an arm's length Option Agreement (the \"<b>Agreement</b>\") with Abcourt Mines Inc. (\"<b>ABI</b>\") pursuant to which ABI granted the Company the option (the \"<b>Option</b>\") to acquire all of ABI's title and interest in the Property. In accordance with the terms and conditions of the Option Agreement, the Company:</p><ul style=\"list-style-type: lower-latin;\"><li>paid ABI the initial cash payment of $500,000 on June 20, 2024, after which it acquired a 25% interest in the Property; and<br /><br /></li><li>elected to accelerate the completion of the outstanding payments totalling $1,500,0000 and complete such payment through the issuance of common shares in the capital of the Company (the \"<b>Shares</b>\") to acquire the remaining 75% interest in the Property. As such, the Company issued ABI 4,299,211 Shares with a deemed price of $0.3489 per Share. The Shares are subject to a statutory hold period of four months plus a day from the date of issuance in accordance with applicable securities legislation.</li></ul><p>Following the Company's exercise of the Option, the Company has:</p><ul style=\"list-style-type: lower-latin;\"><li>granted ABI a two percent (2%) net smelter returns royalty on certain mineral claims comprising the Property; and <br /><br /></li><li>assumed ABI's obligations with respect to certain royalties currently existing on the Property.</li></ul><p>The Property is located within the gold and critical minerals rich Abitibi Greenstone Belt, approximately 60 km north of the city of Val-d'Or and adjacent to the Swanson gold deposit, Abcourt-Barvue base metal (Zn-Pb-Ag) mine, and the Courville and Jolin gold deposits. The Property claims contain the same geological stratigraphy that hosts the Swanson gold deposit, extending the favourable strike length a total of 30 km along a NW to SE trend and over a width of 4 to 9 km. The Property is composed of alternating porphyritic andesites, basalts, rhyolites, and felsic tuffs belonging to the Figury Group as well as syenites, monzonites, diorites, tonalites and granodiorite intrusives. The Property includes both orogenic-type vein (structurally-controlled) and shear-hosted gold-bearing mineralization, with 17 gold (Au) and numerous gold-rich polymetallic (Ag, Cu, Zn, Pb and Mo) showings.</p><p>Gold showings on the Property are referenced from the Qu&#233;bec government SIG&#201;OM geological database and include the:</p><ul style=\"list-style-type: square;\"><li>Jackson Showing - 553.28 g/t Au over 0.8m (historical drilling)</li><li>Jolin Showing - 20.00 g/t Au (historical grab sample)</li><li>Bartec Showing - 3.40 g/t Au over 1.5m (historical drilling)</li><li>Laflamme Sud Showing - 5.97 g/t Au over 0.3m (historical drilling)</li><li>Matttagami Lake showing - 4.29 g/t Au over 0.3m (historical drilling)</li><li>Malbar/Gros Louis Showing - 3.77 g/t Au over 0.9m (historical drilling)</li></ul><p>Several gold showings on the Property also include historical mineral resource estimates referenced in SIG&#201;OM and completed prior to the introduction of CIM and NI 43-101 disclosure standards. </p><p><b>Qualified Person Statement</b></p><p>All scientific and technical information in this news release has been prepared or reviewed and approved by Louis Martin, P.Geo., Technical Advisor to the Company, and a \"Qualified Person\" for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects.</p><p><b>Cautionary Statements and Data Verification</b></p><p>This news release may contain scientific and technical information with respect to adjacent properties to the Company's properties, which the Company has no interest in or rights to explore. Readers are cautioned that information regarding the geology, mineralization, and mineral resources on adjacent properties is not necessarily indicative of the mineralization on the Company's properties.</p><p>The Qualified Person has reviewed the historical scientific and technical information on the Property from historical reports, government geological databases, and scientific papers, but has not yet fully verified the sampling, analytical, and test data underlying this information. Current limitations include getting access to original databases and assay certificates from the historical work programs.</p><p><b>About LaFleur Minerals Inc.</b></p><p>LaFleur Minerals Inc. (CSE: LFLR) (OTC Pink: WPNNF) is a North American junior mining exploration company that has several 100%-owned properties in Quebec's highly sought after gold, critical minerals, and lithium regions in James Bay and Val-d'Or regions. The Company's Vieux Comptoir Property is located approximately 45 km east of the Patriot Battery Metals Corvette Project and 45 km west of Winsome Resources, Adina Project. The Company's Maz&#233;rac Property is easily accessible and located 50 km southwest of Val-d'Or near Vision Lithium's Cadillac Property and Winsome Resources' Decelles Property.</p><p><b>ON BEHALF OF LAFLEUR MINERALS INC.</b></p><p>Paul T&#233;ni&#232;re, P.Geo.<br />Chief Executive Officer <br />E: <a href=\"mailto:teniere@gmail.com\">teniere@gmail.com</a></p><p>LaFleur Minerals Inc.<br />1500-1055 West Georgia Street<br />Vancouver, BC V6E 4N7</p><p><i><b>Neither the Canadian Securities Exchange nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this news release.</b></i></p><p><b>Cautionary Statement Regarding \"Forward-Looking\" Information </b></p><p><i>This news release includes certain statements that may be deemed \"forward-looking statements\". All statements in this new release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include market prices, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/R71reIrn0a\">https://www.newsfilecorp.com/release/215842</a></p>",
    "search_terms": "Abcourt-Barvue (Swanson),LaFleur Minerals Inc.,LFLR",
    "master_gid": 6304,
    "date": "2024-07-08T21:01:00.000Z",
    "tags": "Canada|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2446,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - July 8, 2024) -LaFleur Minerals Inc. (CSE: LFLR) (OTC Pink: WPNNF)(the \"Company\") is pleased to announce that it has fully exercised its option to acquire 141 mineral claims covering 5,579 hectares located in the Province of Qu&#233;bec, Canada, adjacent to the Swanson gold deposit (the",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "LaFleur Minerals Inc.",
    "exchange": "CSE",
    "root_ticker": "LFLR",
    "project_name": "Abcourt-Barvue",
    "gid": 6304,
    "location": "Quebec, Canada",
    "plan_id": "companytier2"
  },
  "articleProject": {
    "gid": 6304,
    "project_name": "Abcourt-Barvue",
    "location": "Quebec, Canada"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2446,
  "articleTicker": "LFLR",
  "articleCompanyName": "LaFleur Minerals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2446,
      "gid": 8249,
      "project_name": "Swanson",
      "location": "Quebec, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 109462,
      "company_id": 2446,
      "title": "LaFleur Minerals Inc. (CSE:LFLR) (OTCQB:LFLRF) Location, Mill Creates Strategic Advantage in Ongoing Gold Rally",
      "link": null,
      "date": "2025-06-26T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 109107,
      "company_id": 2446,
      "title": "LaFleur Minerals Inc. (CSE:LFLR) (OTCQB:LFLRF) Stands Out in Prolific Canadian Gold-Producing Region",
      "link": null,
      "date": "2025-06-24T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 108947,
      "company_id": 2446,
      "title": "LaFleur Minerals Advancing Restart of Beacon Gold Mill and Bulk Sample for Swanson Gold Project",
      "link": null,
      "date": "2025-06-23T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106932,
      "company_id": 2446,
      "title": "LaFleur Minerals Provides Swanson Gold Deposit and Beacon Mill Restart Update to Produce Gold and Announces Investor Call on June 5",
      "link": null,
      "date": "2025-06-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103089,
      "company_id": 2446,
      "title": "LaFleur Minerals Begins Permitting Process for a Bulk Sample from the Swanson Deposit to be Processed at its Beacon Gold Mill",
      "link": null,
      "date": "2025-05-01T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 92700,
      "company_id": 2446,
      "title": "LaFleur Minerals Announces Memorandum of Understanding with Granada Gold on Milling Assessment for the Granada Gold Project Using the Beacon Gold Mill",
      "link": null,
      "date": "2025-03-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92087,
      "company_id": 2446,
      "title": "LaFleur Minerals Provides Update on Beacon Mill Restart, Results of Annual General and Special Meeting, and Swanson Gold Deposit Exploration and Drilling Updates",
      "link": null,
      "date": "2025-03-21T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 89886,
      "company_id": 2446,
      "title": "RETRANSMISSION: LaFleur Minerals to Restart Gold Milling at Beacon Gold Mill in Val-d'Or, Québec",
      "link": "https://www.newsfilecorp.com/release/243008/RETRANSMISSION-LaFleur-Minerals-to-Restart-Gold-Milling-at-Beacon-Gold-Mill-in-ValdOr-Qubec",
      "date": "2025-03-03T14:15:00.000Z",
      "hidden": false
    },
    {
      "id": 89693,
      "company_id": 2446,
      "title": "LaFleur Minerals to Restart Gold Milling at Beacon Gold Mill in Val-d'Or, Québec",
      "link": "https://www.newsfilecorp.com/release/242940/LaFleur-Minerals-to-Restart-Gold-Milling-at-Beacon-Gold-Mill-in-ValdOr-Qubec",
      "date": "2025-02-28T21:37:00.000Z",
      "hidden": false
    },
    {
      "id": 89620,
      "company_id": 2446,
      "title": "LaFleur Minerals Provides Supplemental Disclosure Related to BullRun Option Agreement ",
      "link": "https://www.thenewswire.com/press-releases?id=1L5PFmnmw",
      "date": "2025-02-27T22:00:00.000Z",
      "hidden": false
    }
  ]
}