{
  "article": {
    "id": 18656,
    "link": "https://www.newsfilecorp.com/release/97004/Seabridge-Gold-Strengthens-Management-Team-with-3-Key-Appointments",
    "title": "Seabridge Gold Strengthens Management Team with 3 Key Appointments",
    "description": "Toronto, Ontario--(Newsfile Corp. - September 20, 2021) - Seabridge Gold (TSX: SEA) (NYSE: SA) announced today that it has appointed Ryan Hoel, P.E., as Vice President, Projects; Tracey Meintjes as Vice President, Engineering Studies; and Julie Rachynski as Vice President, Human Resources.<p>Mr. Hoel has more than 20 years of experience in large-scale project management, development, and operations with companies including Rio Tino, Lundin Mining, New Gold, Arizona Mining, and South32. Most recently he served as Vice President, Project Development for South32 at their Hermosa project in Southern Arizona.  Mr. Hoel holds a Bachelor of Science in Mining Engineering from the South Dakota School of Mines and Technology, an MBA from Westminster Gore School of Business, and is a registered Professional Engineer.  </p><p>Mr. Meintjes brings to Seabridge 25 years of experience in mining project development in North America, South America, Europe and Africa. His recent practice as a consultant followed a career with Anglo American, Anglo Gold, Rio Tinto and Teck, with experience in mine evaluations, project acquisitions, metallurgical process development, strategic mine planning, and operations value optimization. He is a Qualified Person in terms of NI 43-101, has co-authored numerous technical reports, and has been involved in a number of mining projects that have successfully advanced from early stage to construction and commissioning. Mr. Meintjes has worked as consultant on the development of the KSM Project for more than 10 years prior to joining Seabridge full time.</p><p>Ms. Rachynski has over 25 years' experience in human resources in the resource industry at site and at corporate levels, including mining, pulp and paper, wood products, and timberlands. Prior to Seabridge, she held leadership positions in human resources in multiple organizations including Weyerhaeuser Canada, Domtar and recently at New Gold leading HR and Community at the New Afton operation and held role of VP HR at corporate. Ms. Rachynski brings experience in diversity and inclusion, organizational design, talent management, compensation and change management. She holds a Bachelor of Business Administration degree with a Human Resource Major from Simon Fraser University and is a registered Human Resources Professional in British Columbia and the Yukon. Ms. Rachynski is an active member of the Mining Association of Canada's HR Diversity and Inclusion Steering Committee, Global Mining HR Community and is a mentor with International Women in Resources Mentorship Program.  </p><p>Seabridge Chairman and CEO Rudi Fronk commented: \"While Seabridge will not be building or operating mines, advancing our projects to the point where they can seamlessly transition to the next stage of development requires an expanded range of management skills. The additions of Ryan, Tracey and Julie collectively bring a breadth of experience and expertise that will be invaluable in advancing Seabridge Gold's project portfolio.\"</p><p>Seabridge holds a 100% interest in several North American gold projects. Seabridge's assets include the KSM and Iskut projects located near Stewart, British Columbia, Canada, the Courageous Lake project located in Canada's Northwest Territories, the Snowstorm project in the Getchell Gold Belt of Northern Nevada and the 3 Aces project in the Yukon Territory. For a full breakdown of Seabridge's mineral reserves and mineral resources by category please visit the Company's website at <a href=\"https://www.newsfilecorp.com/redirect/vRrmwtG5ZM\">https://www.seabridgegold.com/</a>.</p><p><i>None of the Toronto Stock Exchange, New York Stock Exchange, or their Regulation Services Providers accepts responsibility for the adequacy or accuracy of this release. </i></p><p> <b>ON BEHALF OF THE BOARD<br/></b>\"Rudi Fronk\"<br/>Chairman &amp; C.E.O.</p><p>For further information please contact:<br/>Rudi P. Fronk, Chairman and C.E.O.<br/>Tel: (416) 367-9292   •  Fax: (416) 367-2711<br/>Email:  <a href=\"mailto:info@seabridgegold.com\">info@seabridgegold.com</a></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" src=\"https://orders.newsfilecorp.com/files/4600/97004_ec8eddba440ba9e6_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://www.newsfilecorp.com/redirect/JZv8VfxWve\">https://www.newsfilecorp.com/release/97004</a></p><p><img alt=\"\" src=\"https://www.newsfilecorp.com/newsinfo/97004/367\"/></p>]]&gt;",
    "search_terms": "3 Aces,Seabridge Gold Inc.,SEA",
    "master_gid": 872,
    "date": "2021-09-20T07:30:00.000Z",
    "tags": "USA|Arizona,South Dakota||Gold|PEA / Feasibility / 43-101,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 10,
    "provider": null,
    "excerpt": "Toronto, Ontario--(Newsfile Corp. - September 20, 2021) - Seabridge Gold (TSX: SEA) (NYSE: SA) announced today that it has appointed Ryan Hoel, P.E., as Vice President, Projects; Tracey Meintjes as Vice President, Engineering Studies; and Julie Rachynski as Vice President, Human Resources.Mr. Hoel has more than 20 years of experience",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Seabridge Gold Inc.",
    "exchange": "TSX",
    "root_ticker": "SEA",
    "project_name": "3 Aces",
    "gid": 872,
    "location": "Yukon, Canada",
    "plan_id": "companytier2"
  },
  "articleProject": {
    "gid": 872,
    "project_name": "3 Aces",
    "location": "Yukon, Canada"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 10,
  "articleTicker": "SEA",
  "articleCompanyName": "Seabridge Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 10,
      "gid": 667,
      "project_name": "KSM",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 10,
      "gid": 507,
      "project_name": "Seabee",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 10,
      "gid": 509,
      "project_name": "Tina",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 10,
      "gid": 872,
      "project_name": "3 Aces",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 10,
      "gid": 654,
      "project_name": "Iskut",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 10,
      "gid": 5577,
      "project_name": "Courageous Lake",
      "location": "Northwest Territories, Canada"
    },
    {
      "company_id": 10,
      "gid": 10803,
      "project_name": "Snowstorm",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 109520,
      "company_id": 10,
      "title": "Seabridge Gold Reports on Results of Annual Meeting of Shareholders",
      "link": null,
      "date": "2025-06-26T21:44:00.000Z",
      "hidden": false
    },
    {
      "id": 107315,
      "company_id": 10,
      "title": "Seabridge Gold Reports Achievements in Safety, Diversity, and Environmental Stewardship",
      "link": null,
      "date": "2025-06-09T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106769,
      "company_id": 10,
      "title": "Seabridge Gold Begins Drilling Snip North Discovery",
      "link": null,
      "date": "2025-06-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106227,
      "company_id": 10,
      "title": "Seabridge Files Responses to Petitions Challenging KSM's Substantially Started Designation",
      "link": null,
      "date": "2025-05-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104541,
      "company_id": 10,
      "title": "Seabridge Gold Files First Quarter Financial Statements and MD&A",
      "link": null,
      "date": "2025-05-13T22:28:00.000Z",
      "hidden": false
    },
    {
      "id": 100593,
      "company_id": 10,
      "title": "B.C. Government Files Responses to Petitions Challenging KSM's Substantially Started Designation",
      "link": null,
      "date": "2025-04-23T11:46:00.000Z",
      "hidden": false
    },
    {
      "id": 92805,
      "company_id": 10,
      "title": "Seabridge Gold's Appeal of Disallowed Expenditures under BC METC Program is \"Substantially Successful\"",
      "link": null,
      "date": "2025-03-28T11:15:00.000Z",
      "hidden": false
    },
    {
      "id": 92783,
      "company_id": 10,
      "title": "Seabridge Gold Files 2024 Annual Information Form, Year End Audited Financial Statements and MD&A",
      "link": null,
      "date": "2025-03-27T23:52:00.000Z",
      "hidden": false
    },
    {
      "id": 90770,
      "company_id": 10,
      "title": "Seabridge Gold Announces 2025 Corporate Objectives",
      "link": null,
      "date": "2025-03-12T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89264,
      "company_id": 10,
      "title": "Seabridge Gold Reports on 2024 Corporate Objectives",
      "link": "https://www.newsfilecorp.com/release/242380/Seabridge-Gold-Reports-on-2024-Corporate-Objectives",
      "date": "2025-02-26T12:30:00.000Z",
      "hidden": false
    }
  ]
}